//2. Найдите значение функции: с = 3 + а.

public class Task02a {
    public static void main(String[] args) {
        int a = 9, b = 4, c = 5;
        int z = ((a - 3) * b / 2) + c;
        System.out.println("значение функции z = " + z);
    }
}
